{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "CASE_NUMBER",
    "2": "COURT",
    "3": "DATE",
    "4": "JUDGE",
    "5": "PETITIONER",
    "6": "RESPONDENT",
    "7": "PRECEDENT",
    "8": "PROVISION",
    "9": "STATUTE",
    "10": "LAWYER",
    "11": "ORGANIZATION",
    "12": "GPE",
    "13": "WITNESS"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "CASE_NUMBER": 1,
    "COURT": 2,
    "DATE": 3,
    "GPE": 12,
    "JUDGE": 4,
    "LAWYER": 10,
    "O": 0,
    "ORGANIZATION": 11,
    "PETITIONER": 5,
    "PRECEDENT": 7,
    "PROVISION": 8,
    "RESPONDENT": 6,
    "STATUTE": 9,
    "WITNESS": 13
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
